## Plan Result (staging-staging)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.hearings-reform.azurerm_private_dns_cname_record.this[&#34;admin&#34;]
  * module.hearings-reform.azurerm_private_dns_cname_record.this[&#34;video&#34;]
  * module.hearings-reform.azurerm_private_dns_zone.zone[0]
  * module.hearings-reform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hearings-reform.azurerm_private_dns_cname_record.this["admin"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "admin"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "stagings-hearings-reform.hmcts.net"
    }

  # module.hearings-reform.azurerm_private_dns_cname_record.this["video"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "video"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "stagings-hearings-reform.hmcts.net"
    }

  # module.hearings-reform.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "stagings-hearings-reform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.hearings-reform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "stagings-hearings-reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":505,"Program":"tfcmt","SHA1":"","Target":"staging-staging","Vars":{}} -->